---
kind: property
id: P:Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.IsValidObject
source: html/851b9fb3-413a-d40d-bf29-33a951d3b27d.htm
---
# Autodesk.Revit.UI.PromptForFamilyInstancePlacementOptions.IsValidObject Property

Specifies whether the .NET object represents a valid Revit entity.

## Syntax (C#)
```csharp
public bool IsValidObject { get; }
```

## Returns
True if the API object holds a valid Revit native object, false otherwise.

## Remarks
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
 a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.